vocabulary = ['අන්තඃප්ලාස්මීය ජාලිකා ','රළු අන්තඃප්ලාස්මීය ජාලිකා ','සිනිඳු අන්තඃප්ලාස්මීය ජාලිකා ','න්‍යෂ්ටිකාව ',
              'වර්ණදේහ ','ෙසෙල ','චර්ම ෙසෙල ','ප්ලාස්ම පටලය ','ෙසෙල වාදය ','ඌනන විභාජනය ','අනූනන විභාජනය ','වර්ණක ',
              'අස්ථි ෙසෙල ','ෙසෙලීය සංවිධානය ','චලනය ','නව ෙසෙල ','මූල කේශ ෙසෙල ','සීනි ','ඩිම්බ ','පරිණත නොවූ ෙසෙල ',
              'ෙසෙල ප්ලාස්මය ','උප ව්‍යුහ ','වර්ධනය හා විකසනය ','ශුක‍්‍රාණු','කුඩා උප ඒකකය ','ෙශෙලම ෙසෙල ',
              'ෙසෙල ඉන්ද්‍රියිකා හා ව්‍යුහ ','ප්‍රවේණික ද්‍රව්‍ය ','ෙසෙල විභාජනය ','පෝෂණය ','සුදු රුධිරාණු ෙසෙල ',
              'රතු රුධිරාණු ෙසෙල ','ප්ලෝයම ෙසෙල ','ශක්තිය ','ස‍්‍රාවීය ආශයිකා ','පොස්පොලිපිඩ ','ගොල්ගි සංකීර්ණ ',
              'උද්දීප්ත්‍යතාව හා සමායෝජනය ','ස්නායු ෙසෙල ','රයිබොසෝම ','ලිපිඩ ','අයන ','පරිණත ෙසෙල ','ප්‍රෝටීන ',
              'ගොල්ගි දේහ ','ක්‍රොමැටින් ද්‍රව්‍ය ','බහු ෙසෙලික ','ඒක ෙසෙලික ','අපිචර්මීය ෙසෙල ','විශාල උප ඒකක ',
              'අලිංගික ප‍්‍රජනනය ','ලිංගික ප‍්‍රජනනය ','පේශි ෙසෙල ','සෙලියුලෝස් ','ෙසෙල බිත්තිය ','ස‍්‍රාවීය ද්‍රව්‍ය ',
              'මයිටොකොන්ඩි‍්‍රයම ','ප්‍රජනනය ','ජීවින්ට පොදු ලාක්ෂණික ','පූටිකා ෙසෙල ','රුධිර ෙසෙල ','න්‍යෂ්ටිය ',
              'න්‍යෂ්ටි පටලය ','ෙසෙල යුෂය ','ශ්වසනය ','ජීවය ','ආවේණික ලක්ෂණ ','රික්තකය ','සංයෝග ','ජලය ','තානප්ලාස්ටය ',
              'හරිතලව ','කලින් පැවති ෙසෙල ','සත්ත්ව ෙසෙල ','ජන්මාණු ෙසෙල ','පරාග ෙසෙල ','ශාක ෙසෙල ','බහිස්ස්‍රාවය ',
              'පාලක ෙසෙල ','ස්ටෙරොයිඩ ','අණු','තරල ','වර්ණක ද්‍රව්‍ය ','සන්ධාරණය ','කාබනික ද්‍රව්‍ය ',
              'පරිවෘත්තිය ක‍්‍රියා ','ස්වායු ශ්වසන ','ප්‍රෝටීන ','සමජාතී වර්ණදේහ ','මාතෘ ෙසෙල ', 'අලිංගික ප්‍රජනන '
              'දුහිතෘ ෙසෙල ','ද්විගුණ ෙසෙල ','ඒකගුණ ෙසෙල ', 'ජන්මාණු ', 'පරිණාමය ', 'ෙසෙල වර්ධනය ', 'ඉන්ද්‍රයිකා ',
              'ශුක්‍රාණු ', 'ඩිම්බ ', 'ස්වායු ශ්වසනය ', 'ස්‍රාවීය ආශයිකා ', 'හෙමිසෙලියුලෝස් ', 'පෙක්ටීන් ',
              'ප්‍රධාන සංඝටකය ', 'කුඩා රික්තක ', 'විශාල රික්තක ','පරිවෘත්තීය ක්‍රියා ', 'ස්‍රාවීය ද්‍රව්‍ය ',
              'ජවපොළවල් ']

verb_phrase_words = ['වේ', 'වීමට', 'බවට', 'බාහිරින්', 'සෑදී', 'ඇතුළතින්', 'වට', 'ක්‍රමයක්']
conjunctions = ['යනු ','මුලින්ම ', 'දෙවනුව ', 'ඇතිවන ']